In [2]:
import pandas as pd
import numpy as np

In [3]:
#create data frame
userdata={
    'marksa':np.random.randint(1,100,10),
    'marksb':np.random.randint(1,100,10),
    'marksc':np.random.randint(1,100,10)
}


userdata

{'marksa': array([73, 51, 24, 32, 52, 54, 46, 71, 15, 13]),
 'marksb': array([92, 77, 21, 22, 90, 21,  5, 30, 75, 56]),
 'marksc': array([ 2, 18, 48, 74,  1, 75,  2, 83, 11, 20])}

In [5]:
df=pd.DataFrame(userdata)

df

   marksa  marksb  marksc
0      73      92       2
1      51      77      18
2      24      21      48
3      32      22      74
4      52      90       1
5      54      21      75
6      46       5       2
7      71      30      83
8      15      75      11
9      13      56      20

In [6]:
df.head(n=2)

   marksa  marksb  marksc
0      73      92       2
1      51      77      18

In [7]:
df.columns

Index(['marksa', 'marksb', 'marksc'], dtype='object')

In [8]:
df.to_csv('userdata.csv')

In [9]:
df=pd.read_csv('userdata.csv')
df

   Unnamed: 0  marksa  marksb  marksc
0           0      73      92       2
1           1      51      77      18
2           2      24      21      48
3           3      32      22      74
4           4      52      90       1
5           5      54      21      75
6           6      46       5       2
7           7      71      30      83
8           8      15      75      11
9           9      13      56      20

In [10]:
my_data=df.drop(columns=['Unnamed: 0'])
my_data

   marksa  marksb  marksc
0      73      92       2
1      51      77      18
2      24      21      48
3      32      22      74
4      52      90       1
5      54      21      75
6      46       5       2
7      71      30      83
8      15      75      11
9      13      56      20

In [11]:
my_data.describe()

          marksa     marksb     marksc
count  10.000000  10.000000  10.000000
mean   43.100000  48.900000  33.400000
std    21.408461  32.715779  33.320664
min    13.000000   5.000000   1.000000
25%    26.000000  21.250000   4.250000
50%    48.500000  43.000000  19.000000
75%    53.500000  76.500000  67.500000
max    73.000000  92.000000  83.000000

In [16]:
# row wise

my_data.iloc[3]

marksa    32
marksb    22
marksc    74
Name: 3, dtype: int64

In [17]:
my_data.iloc[3,1]

22

In [18]:
my_data.iloc[3][1]

22